Revit 2027 API
Application.NewBoundingBoxUV(Double, Double, Double, Double) Method
Creates a two-dimensional rectangle with supplied values.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundingBoxUV NewBoundingBoxUV(
	double min_u,
	double min_v,
	double max_u,
	double max_v
)
Public Function NewBoundingBoxUV (
	min_u As Double,
	min_v As Double,
	max_u As Double,
	max_v As Double
) As BoundingBoxUV
public:
BoundingBoxUV^ NewBoundingBoxUV(
	double min_u,
	double min_v,
	double max_u,
	double max_v
)
member NewBoundingBoxUV :
        min_u : float *
        min_v : float *
        max_u : float *
        max_v : float -> BoundingBoxUV
Parameters
min_u Double
The first coordinate of min.
min_v Double
The second coordinate of min.
max_u Double
The first coordinate of max.
max_v Double
The second coordinate of max.
Return Value
BoundingBoxUV
See Also
Reference
Application Class
NewBoundingBoxUV Overload
Autodesk.Revit.Creation Namespace